# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [11]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis =1)
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [23]:
baby_names["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [48]:
#Mine
baby_names.groupby('Name')['Count'].sum().sort_values(ascending = False).head(20)

Name
Jacob          242874
Emma           214852
Michael        214405
Ethan          209277
Isabella       204798
William        197894
Joshua         191551
Sophia         191446
Daniel         191440
Emily          190318
Olivia         188036
Alexander      187189
Matthew        185279
Noah           179925
Anthony        179256
Andrew         174975
Christopher    172997
Joseph         169972
David          167606
Ava            167369
Name: Count, dtype: int64

In [52]:
# you don't want to sum the Year column, so you delete it
#del baby_names["Year"]

# group the data
names = baby_names.groupby("Name").sum()

# print the first 5 observations
names.head()

# print the size of the dataset
print(names.shape)

# sort it from the biggest value to the smallest one
res = names.sort_values("Count", ascending = 0).head(20)
res

(17632, 1)

C:\Users\admin\AppData\Local\Temp\ipykernel_10556\2930534149.py:5: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  names = baby_names.groupby("Name").sum()

              Count
Name
Jacob        242874
Emma         214852
Michael      214405
Ethan        209277
Isabella     204798
William      197894
Joshua       191551
Sophia       191446
Daniel       191440
Emily        190318
Olivia       188036
Alexander    187189
Matthew      185279
Noah         179925
Anthony      179256
Andrew       174975
Christopher  172997
Joseph       169972
David        167606
Ava          167369

### Step 8. How many different names exist in the dataset?

In [50]:
baby_names["Name"].nunique()

17632

### Step 9. What is the name with most occurrences?

In [69]:
res.iloc[0]

Count    242874
Name: Jacob, dtype: int64

In [67]:
#or
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [77]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [78]:
(names[names.Count == names.Count.median()])

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [81]:
names.Count.std()

11006.06946789057

In [82]:
names.std()

Count    11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [83]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000